#+TITLE: Leetcode and Neetcode problems
#+PROPERTY: header-args :session *leetcode* :kernel python3 :mkdirp yes :noweb yes
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usepackage{svg}
#+OPTIONS: tex:t

** Top K Frequent Elements
:PROPERTIES:
:CREATED:  [2023-08-30 Wed 12:09]
:ID:       4173b642-5d71-404e-a1ec-83e6b204c6bf
:END:
#+begin_src jupyter-python
# Let's define a function named `top_k_frequent`, which takes two parameters: `nums` and `k`.
# `nums` is the list of numbers and `k` is the number of most frequent elements to return.

from collections import Counter

def top_k_frequent(nums, k):
    # First, we use Python's `Counter` from the collections module to get the frequency of each number in the list.
    count = Counter(nums)

    # Then, we use the `most_common(k)` method of the Counter object, which returns the `k` most common elements and their counts.
    # We only need the elements, not their counts, so we use a list comprehension to extract the elements.
    top_k_elements = [num for num, _ in count.most_common(k)]

    return top_k_elements

# Let's test our function with the examples from the problem statement.

print(top_k_frequent([1,1,1,2,2,3], 2))  # Expected output: [1,2]

print(top_k_frequent([1], 1))  # Expected output: [1]

#+end_src

#+RESULTS:
: [1, 2]
: [1]

